In [6]:
import pandas as pd
import numpy as np
from sklearn.preprocessing import MinMaxScaler

In [2]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Age': [25, np.nan, 35, 40, np.nan],
    'Salary': [50000, 60000, np.nan, 80000, 75000]
}

df = pd.DataFrame(data)
print("Original Dataset:")
df

Original Dataset:

      Name   Age   Salary
0    Alice  25.0  50000.0
1      Bob   NaN  60000.0
2  Charlie  35.0      NaN
3    David  40.0  80000.0
4      Eve   NaN  75000.0

In [3]:
print("Missing Values Count:")
df.isnull().sum()

Missing Values Count:

Name      0
Age       2
Salary    1
dtype: int64

In [4]:
df_dropped = df.dropna()
print("After Dropping Rows with Missing Values:")
df_dropped

After Dropping Rows with Missing Values:

    Name   Age   Salary
0  Alice  25.0  50000.0
3  David  40.0  80000.0

In [5]:
# Fill  Age with mean
df['Age'].fillna(df['Age'].mean(), inplace=True)

# Fill missing Salary with median
df['Salary'].fillna(df['Salary'].median(), inplace=True)

print("After Filling Missing Values:")
df

After Filling Missing Values:

C:\Users\Uday\AppData\Local\Temp\ipykernel_36400\333753536.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].fillna(df['Age'].mean(), inplace=True)
C:\Users\Uday\AppData\Local\Temp\ipykernel_36400\333753536.py:5: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Salary'].fillna(df['Salary'].median(), inplace=True)

      Name        Age   Salary
0    Alice  25.000000  50000.0
1      Bob  33.333333  60000.0
2  Charlie  35.000000  67500.0
3    David  40.000000  80000.0
4      Eve  33.333333  75000.0